fio-test/results/14jobs_worker_on/9-psync-1.out
job1: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 9 processes

job1: (groupid=0, jobs=9): err= 0: pid=63648: Mon Aug 19 18:38:49 2024
  write: IOPS=4024, BW=4025MiB/s (4220MB/s)(757GiB/192663msec); 0 zone resets
    clat (usec): min=475, max=5227, avg=2153.16, stdev=425.26
     lat (usec): min=535, max=5294, avg=2229.88, stdev=419.22
    clat percentiles (usec):
     |  1.00th=[ 1696],  5.00th=[ 1778], 10.00th=[ 1827], 20.00th=[ 1909],
     | 30.00th=[ 1975], 40.00th=[ 2008], 50.00th=[ 2073], 60.00th=[ 2147],
     | 70.00th=[ 2212], 80.00th=[ 2278], 90.00th=[ 2409], 95.00th=[ 2737],
     | 99.00th=[ 4359], 99.50th=[ 4555], 99.90th=[ 4752], 99.95th=[ 4817],
     | 99.99th=[ 4948]
   bw (  MiB/s): min= 3420, max= 4640, per=100.00%, avg=4029.13, stdev=24.78, samples=3465
   iops        : min= 3420, max= 4640, avg=4027.29, stdev=24.81, samples=3465
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.03%
  lat (msec)   : 2=37.67%, 4=60.41%, 10=1.88%
  cpu          : usr=3.83%, sys=3.26%, ctx=775542, majf=0, minf=136
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,775440,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4025MiB/s (4220MB/s), 4025MiB/s-4025MiB/s (4220MB/s-4220MB/s), io=757GiB (813GB), run=192663-192663msec

Disk stats (read/write):
    dm-0: ios=0/775255, merge=0/0, ticks=0/1584044, in_queue=1584044, util=100.00%, aggrios=11/387720, aggrmerge=0/0, aggrticks=1/40019, aggrin_queue=40020, aggrutil=100.00%
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme3n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme1n2: ios=26/775440, merge=0/0, ticks=3/78443, in_queue=78445, util=100.00%
  nvme4n2: ios=12/775440, merge=0/0, ticks=2/81442, in_queue=81443, util=100.00%
  nvme2n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme0n2: ios=36/775440, merge=0/0, ticks=2/78901, in_queue=78903, util=100.00%
  nvme3n2: ios=18/775440, merge=0/0, ticks=2/80899, in_queue=80901, util=100.00%
  nvme1n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme4n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n2: ios=20/775440, merge=0/0, ticks=2/80513, in_queue=80515, util=100.00%